In [50]:
import pandas as pd

In [51]:
fc_transaction_base = pd.read_csv("C:/Users/acer/Downloads/fc_transaction_base.csv")

In [52]:
fc_transaction_base.head()

,tran_date,account_number,branch,product,lcy_amount,transaction_code,description1,dc_indicator,is_salary
0,09/06/2020,02XYZXYZ10017529992,15.0,SBA,14500.0,CI,ATM WDL /00463701/NABIL\NABIL,withdraw,0.0
1,14/06/2020,02XYZXYZ10017529992,15.0,SBA,20000.0,CI,ATM WDL /00463701/NABIL\NABIL,withdraw,0.0
2,01/06/2020,02XYZXYZ10017517823,15.0,SBA,4000.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0
3,05/06/2020,02XYZXYZ10017517823,15.0,SBA,500.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0
4,12/06/2020,02XYZXYZ10017517823,15.0,SBA,5000.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0

In [53]:
fc_account_master = pd.read_csv("C:/Users/acer/Downloads/assignment_2/assignment_2/fc_account_master.csv")

In [54]:
fc_account_master.head()

,account_number,customer_code,product,product_category,acc_open_date,acc_closed_date,active_flag
0,02XYZXYZ10015592101,KL0255921,SBA,SBPPS,1999-03-10,NaN,0
1,02XYZXYZ10015593701,KL0255937,SBA,SBPPS,1999-03-10,NaN,0
2,02XYZXYZ10015593801,KL0255938,SBA,SBPPS,1999-03-10,NaN,0
3,02XYZXYZ10015594801,KL0255948,SBA,SBANU,1999-03-22,NaN,0
4,02XYZXYZ10015597601,KL0255976,SBA,SBPPS,1999-04-22,NaN,0

In [55]:
fc_transaction_base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45032 entries, 0 to 45031
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   tran_date         45032 non-null  object
 1   account_number    45031 non-null  object
 2   branch            45031 non-null  float64
 3   product           45031 non-null  object
 4   lcy_amount        45031 non-null  float64
 5   transaction_code  45031 non-null  object
 6   description1      44959 non-null  object
 7   dc_indicator      45030 non-null  object
 8   is_salary         45030 non-null  float64
dtypes: float64(3), object(6)
memory usage: 3.1+ MB

In [56]:
fc_transaction_base["tran_date"][70:74]

70    04/06/2020
71    04/06/2020
72    12/06/2020
73    08/06/2020
Name: tran_date, dtype: object

In [57]:
fc_transaction_base = fc_transaction_base[fc_transaction_base['tran_date'].str.match(r'\d{2}/\d{2}/\d{4}')]
fc_transaction_base["tran_date"] =pd.to_datetime(fc_transaction_base["tran_date"],format = '%d/%m/%Y')

In [58]:
fc_transaction_base.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45031 entries, 0 to 45031
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   tran_date         45031 non-null  datetime64[ns]
 1   account_number    45031 non-null  object
 2   branch            45031 non-null  float64
 3   product           45031 non-null  object
 4   lcy_amount        45031 non-null  float64
 5   transaction_code  45031 non-null  object
 6   description1      44959 non-null  object
 7   dc_indicator      45030 non-null  object
 8   is_salary         45030 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(5)
memory usage: 3.4+ MB

In [59]:
fc_transaction_base['month'] = pd.to_datetime(fc_transaction_base['tran_date']).dt.month

In [60]:
grouped_df = fc_transaction_base.groupby(['month', 'dc_indicator'])['lcy_amount'] .agg(['mean', 'std', 'var']) .reset_index()

In [61]:
grouped_df

   month dc_indicator          mean            std           var
0      6      deposit  99075.475634  319613.387306  1.021527e+11
1      6     withdraw  23076.009774  141984.582935  2.015962e+10
2      7      deposit  72276.673438  334540.145977  1.119171e+11
3      7     withdraw  29542.774371  206448.557923  4.262101e+10
4      8      deposit  56295.855224  273560.866915  7.483555e+10
5      8     withdraw  25084.110745  171971.277190  2.957412e+10

In [62]:
pivoted_df = grouped_df.pivot_table(index='month', columns='dc_indicator', values=['mean', 'std', 'var'])

In [63]:
pivoted_df

                      mean                          std                 \
dc_indicator       deposit      withdraw        deposit       withdraw
month
6             99075.475634  23076.009774  319613.387306  141984.582935
7             72276.673438  29542.774371  334540.145977  206448.557923
8             56295.855224  25084.110745  273560.866915  171971.277190

                       var
dc_indicator       deposit      withdraw
month
6             1.021527e+11  2.015962e+10
7             1.119171e+11  4.262101e+10
8             7.483555e+10  2.957412e+10

In [64]:
fc_account_master.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1839 entries, 0 to 1838
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   account_number    1839 non-null   object
 1   customer_code     1839 non-null   object
 2   product           1839 non-null   object
 3   product_category  1839 non-null   object
 4   acc_open_date     1839 non-null   object
 5   acc_closed_date   0 non-null      float64
 6   active_flag       1839 non-null   int64
dtypes: float64(1), int64(1), object(5)
memory usage: 100.7+ KB

In [65]:
joined = pd.merge(fc_account_master, fc_transaction_base, on='account_number', how='inner')

In [66]:
joined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45031 entries, 0 to 45030
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   account_number    45031 non-null  object
 1   customer_code     45031 non-null  object
 2   product_x         45031 non-null  object
 3   product_category  45031 non-null  object
 4   acc_open_date     45031 non-null  object
 5   acc_closed_date   0 non-null      float64
 6   active_flag       45031 non-null  int64
 7   tran_date         45031 non-null  datetime64[ns]
 8   branch            45031 non-null  float64
 9   product_y         45031 non-null  object
 10  lcy_amount        45031 non-null  float64
 11  transaction_code  45031 non-null  object
 12  description1      44959 non-null  object
 13  dc_indicator      45030 non-null  object
 14  is_salary         45030 non-null  float64
 15  month             45031 non-null  int32
dtypes: datetime64[ns](1), float64(4), int32(1), int64(1), object(9)
memory usage: 5.3+ MB

In [42]:
joined.head()

,tran_date,account_number,branch,product_x,lcy_amount,transaction_code,description1,dc_indicator,is_salary,month,customer_code,product_y,product_category,acc_open_date,acc_closed_date,active_flag
0,2020-06-09,02XYZXYZ10017529992,15.0,SBA,14500.0,CI,ATM WDL /00463701/NABIL\NABIL,withdraw,0.0,6,PB2083592,SBA,SBPPS,2009-05-08,NaN,0
1,2020-06-14,02XYZXYZ10017529992,15.0,SBA,20000.0,CI,ATM WDL /00463701/NABIL\NABIL,withdraw,0.0,6,PB2083592,SBA,SBPPS,2009-05-08,NaN,0
2,2020-06-01,02XYZXYZ10017517823,15.0,SBA,4000.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0,6,KL2052631,SBA,SBPPS,2008-06-09,NaN,0
3,2020-06-05,02XYZXYZ10017517823,15.0,SBA,500.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0,6,KL2052631,SBA,SBPPS,2008-06-09,NaN,0
4,2020-06-12,02XYZXYZ10017517823,15.0,SBA,5000.0,CI,ATM WDL /NICAV701/\Pharping\KT,withdraw,0.0,6,KL2052631,SBA,SBPPS,2008-06-09,NaN,0

In [68]:
grouped_df = joined.groupby(['account_number','month', 'dc_indicator'])['lcy_amount'] .agg(['mean', 'std', 'var']) .reset_index()

In [69]:
grouped_df.head()

,account_number,month,dc_indicator,mean,std,var
0,02XYZXYZ10015339701,6,deposit,950000.000000,294957.624075,8.700000e+10
1,02XYZXYZ10015339701,6,withdraw,45648.000000,59090.604329,3.491700e+09
2,02XYZXYZ10015339701,7,deposit,436065.845000,336204.707648,1.130336e+11
3,02XYZXYZ10015339701,7,withdraw,40169.091429,49802.888915,2.480328e+09
4,02XYZXYZ10015339701,8,deposit,25856.000000,NaN,NaN

In [70]:
pivoted_df = grouped_df.pivot_table(index=['account_number', 'month'], columns='dc_indicator', values=['mean', 'std', 'var'])

In [71]:
pivoted_df

                                     mean                           std  \
dc_indicator                      deposit       withdraw        deposit
account_number       month
02XYZXYZ10015339701  6      950000.000000   45648.000000  294957.624075
                     7      436065.845000   40169.091429  336204.707648
                     8       25856.000000  123633.333333            NaN
02XYZXYZ10015571501  6      900000.000000    3265.285714            NaN
                     7      307317.236000  202542.882500  405770.888317
...                                   ...            ...            ...
02XYZXYZ110017507524 7        8196.193333     570.515000    8621.115890
                     8                NaN    6341.800000            NaN
02XYZXYZ110017507568 6        2623.500000   24000.000000            NaN
                     7        2134.925000       8.070000    2791.056531
                     8       30526.650000   35000.000000            NaN

                                                    var
dc_indicator                     withdraw       deposit      withdraw
account_number       month
02XYZXYZ10015339701  6       59090.604329  8.700000e+10  3.491700e+09
                     7       49802.888915  1.130336e+11  2.480328e+09
                     8      116364.098129           NaN  1.354060e+10
02XYZXYZ10015571501  6        2144.792664           NaN  4.600136e+06
                     7      362798.668627  1.646500e+11  1.316229e+11
...                                   ...           ...           ...
02XYZXYZ110017507524 7         785.574421  7.432364e+07  6.171272e+05
                     8        9356.342031           NaN  8.754114e+07
02XYZXYZ110017507568 6       22627.416998           NaN  5.120000e+08
                     7                NaN  7.789997e+06           NaN
                     8                NaN           NaN           NaN

[4982 rows x 6 columns]